# CARGA DE DATOS A TRAVÉS DE LA FUNCIÓN read_csv

In [60]:
import pandas as pd
import numpy as np
import csv
import urllib3
import os
import xlrd

In [61]:
mainpath = "/Users/Ricar/Documents/Proyectos/MACHINE LEARNING - UDEMY/Datasets"
filename = "titanic/titanic3.csv"
fullpath = os.path.join(mainpath,filename)

In [62]:
data = pd.read_csv(fullpath)
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [63]:
data2 = pd.read_csv(fullpath, sep=",", dtype=None, names=None , header="infer",skiprows=None,index_col=None, na_filter=True)
data2.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

## Argumentos de la función read_csv (mas importantes)
* filepath = Ruta de acceso al archivo.
* sep = Delimitador del dataset a leer. (Por defecto es ",").
* dtype = Es el tipo de dato de las columnas del dataset(Por defecto es None).
* header = Es el # de fila para la cabezera del dataset(Por defecto es "Infer").
* names = Se utiliza para indicar el nombre de las columnas. (Por defecto es None).
* skiprows = Se utiliza para saltar un determinado numero de filas (Por defecto es None).
* index_col = Indica el numero de columna la cual será la etiqueta del dataset(Por defecto es None).
* skip_blank_lines = Indica si las líneas en blanco que haya en el fichero, serán saltadas y no serán valores Nan  (Por defecto es False).
* na_filter = Detecta los marcadores de los valores faltantes y remplaza por NA (Por defecto es True).

In [64]:
filename = "customer-churn-model/Customer Churn Model.txt"
fullpath = os.path.join(mainpath,filename)
data3 = pd.read_csv(fullpath)
data3.head()

,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
0,KS,128,415,382-4657,no,yes,25,265.1,110,45.07,...,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False.
1,OH,107,415,371-7191,no,yes,26,161.6,123,27.47,...,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False.
2,NJ,137,415,358-1921,no,no,0,243.4,114,41.38,...,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False.
3,OH,84,408,375-9999,yes,no,0,299.4,71,50.90,...,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False.
4,OK,75,415,330-6626,yes,no,0,166.7,113,28.34,...,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False.

In [65]:
data3.columns.values

array(['State', 'Account Length', 'Area Code', 'Phone', "Int'l Plan",
       'VMail Plan', 'VMail Message', 'Day Mins', 'Day Calls',
       'Day Charge', 'Eve Mins', 'Eve Calls', 'Eve Charge', 'Night Mins',
       'Night Calls', 'Night Charge', 'Intl Mins', 'Intl Calls',
       'Intl Charge', 'CustServ Calls', 'Churn?'], dtype=object)

In [66]:
nombre_cols = pd.read_csv(mainpath + "/" + "customer-churn-model/Customer Churn Columns.csv")
data4 = pd.read_csv(fullpath, names= nombre_cols["Column_Names"].tolist())
data4.columns.values

array(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
       'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U'], dtype=object)

## Carga de datos a través de la función open

In [67]:
data5 = open(mainpath + "/" +  "customer-churn-model/Customer Churn Model.txt", "r")

In [68]:
cols = data5.readline().strip().split(",")
n_cols = len(cols)

In [69]:
n_cols

21

In [70]:
counter = 0
main_dict = {}
for col in cols:
    main_dict[col] = []

In [71]:
for line in data5:
    values = line.strip().split(",")
    for i in range(len(cols)):
        main_dict[cols[i]].append(values[i])
    counter +=1
print("El data set tiene %d filas y %d columnas"%(counter,n_cols))

El data set tiene 3333 filas y 21 columnas

In [72]:
df5 = pd.DataFrame(main_dict)
df5.head()

,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
0,KS,128,415,382-4657,no,yes,25,265.100000,110,45.070000,...,99,16.780000,244.700000,91,11.010000,10.000000,3,2.700000,1,False.
1,OH,107,415,371-7191,no,yes,26,161.600000,123,27.470000,...,103,16.620000,254.400000,103,11.450000,13.700000,3,3.700000,1,False.
2,NJ,137,415,358-1921,no,no,0,243.400000,114,41.380000,...,110,10.300000,162.600000,104,7.320000,12.200000,5,3.290000,0,False.
3,OH,84,408,375-9999,yes,no,0,299.400000,71,50.900000,...,88,5.260000,196.900000,89,8.860000,6.600000,7,1.780000,2,False.
4,OK,75,415,330-6626,yes,no,0,166.700000,113,28.340000,...,122,12.610000,186.900000,121,8.410000,10.100000,3,2.730000,3,False.

## Lectura y escritura de ficheros

In [73]:
infile = mainpath + "/" +  "customer-churn-model/Customer Churn Model.txt"  
outfile = mainpath + "/" +  "customer-churn-model/Tab Customer Churn Model.txt"

In [74]:
with open(infile) as infile1:
    with open(outfile, "w") as outfile1:
        for line in infile1:
            fields = line.strip().split(",")
            outfile1.write("\t".join(fields))
            outfile1.write("\n")

In [75]:
df6 = pd.read_csv(outfile, sep="\t")
df6.head()

,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
0,KS,128,415,382-4657,no,yes,25,265.1,110,45.07,...,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False.
1,OH,107,415,371-7191,no,yes,26,161.6,123,27.47,...,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False.
2,NJ,137,415,358-1921,no,no,0,243.4,114,41.38,...,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False.
3,OH,84,408,375-9999,yes,no,0,299.4,71,50.90,...,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False.
4,OK,75,415,330-6626,yes,no,0,166.7,113,28.34,...,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False.

## Leer datos desde una URL

In [76]:
medals_url = "http://winterolympicsmedals.com/medals.csv"

In [77]:
medals_data = pd.read_csv("http://winterolympicsmedals.com/medals.csv")
medals_data.head()

,Year,City,Sport,Discipline,NOC,Event,Event gender,Medal
0,1924,Chamonix,Skating,Figure skating,AUT,individual,M,Silver
1,1924,Chamonix,Skating,Figure skating,AUT,individual,W,Gold
2,1924,Chamonix,Skating,Figure skating,AUT,pairs,X,Gold
3,1924,Chamonix,Bobsleigh,Bobsleigh,BEL,four-man,M,Bronze
4,1924,Chamonix,Ice Hockey,Ice Hockey,CAN,ice hockey,M,Gold

200

## Descarga de datos de una url

In [95]:
def dataframe_url(link, filename, fcod='UTF-8', sep=",", dem="\n", mainpath = "/Users/Ricar/Documents/Proyectos/MACHINE LEARNING - UDEMY/Datasets"):
    respuesta = urllib3.PoolManager().request('GET', link)
    data = respuesta.data.decode(encoding=fcod)
    data = data.split(dem)
    main_dict = {}
    cols = data[0].split(sep)
    for i in cols:
        main_dict[i] = []
    for j in range(1,len(data)):
        valores = data[j].split(sep)
        for k in range(len(cols)):
            main_dict[cols[k]].append(valores[k])
    df = pd.DataFrame(main_dict)
    fullpath = os.path.join(mainpath, filename)
    df.to_json(fullpath+'.json')
    df.to_csv(fullpath+'.csv')
    df.to_latex(fullpath+'xlsx')
    return(df)

In [99]:
medals_df = dataframe_url("http://winterolympicsmedals.com/medals.csv", filename='athletes/medallas_descargas')
medals_df.head()

,Year,City,Sport,Discipline,NOC,Event,Event gender,Medal
0,1924,Chamonix,Skating,Figure skating,AUT,individual,M,Silver
1,1924,Chamonix,Skating,Figure skating,AUT,individual,W,Gold
2,1924,Chamonix,Skating,Figure skating,AUT,pairs,X,Gold
3,1924,Chamonix,Bobsleigh,Bobsleigh,BEL,four-man,M,Bronze
4,1924,Chamonix,Ice Hockey,Ice Hockey,CAN,ice hockey,M,Gold

## Fichers xls y xlsx

In [100]:
filename = 'titanic/titanic3.xlsx'
titanic2 = pd.read_excel(mainpath + '/' + filename, sheet_name='titanic3')
titanic2.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [102]:
titanic2.to_csv(mainpath + '/' + 'titanic/titanic3_custom.csv')
titanic2.to_excel(mainpath + '/' + 'titanic/titanic3_custom.xlsx')
titanic2.to_json(mainpath + '/' + 'titanic/titanic3_custom.json')